data = [
    #лар
    ( "плита" , "лар" ),
    ( "май" , "лар" ),
    ( "суу" , "лар" ),
    ( "картошка" , "лар" ),
    ( "шапка" , "лар" ),
    # ( "шыпыргы" , "лар" ),
    # ( "будай" , "лар" ),
    # ( "арпа" , "лар" ),
    # ( "баа" , "лар" ),
    # ( "алма" , "лар" ),
    # ( "жай" , "лар" ),
    # ( "тандыр" , "лар" ),
    # ( "жаныбар" , "лар" ),
    # ( "бала" , "лар" ),
    # ( "ата" , "лар" ),
    # ( "сумка" , "лар" ),
    # ( "унаа" , "лар" ),
    # ( "ата" , "лар" ),
    # ( "баа" , "лар" ),
    # ( "музыка" , "лар" ),
    # ( "акча" , "лар" ),
    # ( "чака" , "лар" ),
    # ( "жыт" , "лар" ),
    # ( "атыр" , "лар" ),
    # ( "базар" , "лар" ),
    # ( "шаар" , "лар" ),
    # ( "жазуу" , "лар" ),
    # ( "ага" , "лар" ),
    # ( "чыны" , "лар" ),
    # ( "ата" , "лар" ),
    # ( "такта" , "лар" ),
    # ( "маанай" , "лар" ),
    # ( "шыпыргы" , "лар" ),
    # ( "акча" , "лар" ),
    # ( "кур" , "лар" ),
    # ( "алча" , "лар" ),



    #лер
    ( "киши" , "лер" ),
    ( "дептер" , "лер" ),
    ( "жеңе" , "лер" ),
    ( "пикир" , "лер" ),
    ( "мамиле" , "лер" ),
    # ( "кофе" , "лер" ),
    # ( "очки" , "лер" ),
    # ( "компьютер" , "лер" ),
    # ( "компютер" , "лер" ),
    # ( "эжей" , "лер" ),
    # ( "калемпир" , "лер" ),



    #лор
    ( "ой" , "лор" ),
    ( "тоо" , "лор" ),
    ( "памидор" , "лор" ),
    ( "чорго" , "лор" ),
    ( "кой" , "лор" ),



    #лөр
    ( "үй" , "лөр" ),
    ( "жүгөрү" , "лөр" ),
    ( "сүлгү" , "лөр" ),
    ( "мөндүр" , "лөр" ),
    ( "лөөлү" , "лөр" ),



    #дар
    ( "кагаз" , "дар" ),
    ( "отун" , "дар" ),
    ( "аял" , "дар" ),
    ( "кыз" , "дар" ),
    ( "чагылган" , "дар" ),
    # ( "кан" , "дар" ),
    # ( "ашказан" , "дар" ),
    # ( "жаан" , "дар" ),
    # ( "адам" , "дар" ),
    # ( "зым" , "дар" ),
    # ( "шым" , "дар" ),
    # ( "казан" , "дар" ),
    # ( "жаз" , "дар" ),
    # ( "курал" , "дар" ),
    # ( "чычкан" , "дар" ),
    # ( "дарбыз" , "дар" ),
    # ( "бадраң" , "дар" ),
    # ( "пияз" , "дар" ),
    # ( "самын" , "дар" ),
    # ( "самын" , "дар" ),
    # ( "костюм" , "дар" ),



    #дор
    ( "телефон" , "дор" ),
    ( "кол" , "дор" ),
    ( "тон" , "дор" ),
    ( "коон" , "дор" ),
    ( "ооз" , "дор" ),



    #дер
    ( "калем" , "дер" ),
    ( "жээн" , "дер" ),
    ( "калем" , "дер" ),
    ( "кийим" , "дер" ),
    ( "мугалим" , "дер" ),
    ( "меиз" , "дер" ),



    #дөр
    ( "жүзүм" , "дөр" ),
    ( "дөң" , "дөр" ),
    ( "өлүм" , "дөр" ),
    ( "өрдөк" , "дөр" ),
    ( "сүлөөсүн" , "дөр" ),



    #тар
    ( "жыгач" , "тар" ),
    ( "жалбырак" , "тар" ),
    ( "сандык" , "тар" ),
    ( "бак" , "тар" ),
    ( "балалык" , "тар" ),
    # ( "жанылык" , "тар" ),
    # ( "майлык" , "тар" ),
    # ( "чогулуш" , "тар" ),
    # ( "кубат" , "тар" ),
    # ( "каш" , "тар" ),
    # ( "кыш" , "тар" ),
    # ( "жалгыздык" , "тар" ),
    # ( "учкуч" , "тар" ),
    # ( "мышык" , "тар" ),
    # ( "курулуш" , "тар" ),
    # ( "алмурут" , "тар" ),
    # ( "жаңгак" , "тар" ),
    # ( "колкап" , "тар" ),
    # ( "балык" , "тар" ),
    # ( "жержангак" , "тар" ),
    # ( "ачкыч" , "тар" ),
    # ( "адат" , "тар" ),
    # ( "салт" , "тар" ),
    # ( "акмак" , "тар" ),
    # ( "алачык" , "тар" ),
    # ( "салык" , "тар" ),
    # ( "отургуч" , "тар" ),



    #тор
    ( "от" , "тор" ),
    ( "дос" , "тор" ),
    ( "абрикос" , "тор" ),
    ( "бот" , "тор" ),
    ( "акоп" , "тор" ),



    #тер
    ( "китеп" , "тер" ),
    ( "берилиш" , "тер" ),
    ( "эшик" , "тер" ),
    ( "ит" , "тер" ),
    ( "эшик" , "тер" ),
    # ( "супермаркет" , "тер" ),
    # ( "интернет" , "тер" ),
    # ( "чайнек" , "тер" ),
    # ( "эт" , "тер" ),
    # ( "идиш" , "тер" ),
    # ( "акырет" , "тер" ),
    # ( "университет" , "тер" ),
    # ( "китеп" , "тер" ),



    #төр
    ( "өчүргүч" , "төр" ),
    ( "көпчүлүк" , "төр" ),
    ( "көйнөк" , "төр" ),
    ( "чөп" , "төр" ),
    ( "өрүк" , "төр" ),
    # ( "көйнөк" , "төр" ),
    # ( "көйнөк" , "төр" ),
    # ( "сүт" , "төр" ),

]
texts, labels = zip(*data)

label_mapping = {"лар": 0, "лер": 1, "лор": 2, "лөр": 3, "дар": 4, "дор": 5, "дер": 6, "дөр" : 7, "тар": 8, "тор" : 9, "тер": 10, "төр": 11}
